Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.3.66/samv71b/edc/ATSAMV71J19B.PIC
      <edc:AdjustPoint edc:_addr="0x40020070" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x4002007C" edc:access="------------------------nnnnnnnn" edc:cname="PWM0_ELMR0" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="Comparison 0 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="Comparison 1 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="Comparison 2 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:desc="Comparison 3 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:desc="Comparison 4 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:desc="Comparison 5 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:desc="Comparison 6 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:desc="Comparison 7 Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020080" edc:access="------------------------nnnnnnnn" edc:cname="PWM0_ELMR1" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CSEL0" edc:desc="Comparison 0 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL1" edc:desc="Comparison 1 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL2" edc:desc="Comparison 2 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL3" edc:desc="Comparison 3 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL4" edc:desc="Comparison 4 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL5" edc:desc="Comparison 5 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL6" edc:desc="Comparison 6 Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSEL7" edc:desc="Comparison 7 Selection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40020084" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x400200A0" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM0_SSPR" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="SPRD" edc:desc="Spread Spectrum Limit Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="SPRDM" edc:desc="Spread Spectrum Counter Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400200A4" edc:access="--------wwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM0_SSPUP" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="SPRDUP" edc:desc="Spread Spectrum Limit Value Update" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400200A8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x400200B0" edc:access="--------------nn--------------nn" edc:cname="PWM0_SMMR" edc:impl="0x30003" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="GCEN0" edc:desc="Gray Count ENable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCEN1" edc:desc="Gray Count ENable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xE"/>
            <edc:SFRFieldDef edc:cname="DOWN0" edc:desc="DOWN Count" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DOWN1" edc:desc="DOWN Count" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400200B4" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400200C0" edc:access="------------nnnn------------nnnn" edc:cname="PWM0_FPV2" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="FPZH0" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZH1" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZH2" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZH3" edc:desc="Fault Protection to Hi-Z for PWMH output on channel 3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FPZL0" edc:desc="Fault Protection to Hi-Z for PWML output on channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZL1" edc:desc="Fault Protection to Hi-Z for PWML output on channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZL2" edc:desc="Fault Protection to Hi-Z for PWML output on channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FPZL3" edc:desc="Fault Protection to Hi-Z for PWML output on channel 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400200C4" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x400200E4" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM0_WPCR" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WPCMD" edc:desc="Write Protection Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE_SW_PROT" edc:desc="Disables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_SW_PROT" edc:desc="Enables the software write protection of the register groups of which the bit WPRGx is at '1'." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ENABLE_HW_PROT" edc:desc="Enables the hardware write protection of the register groups of which the bit WPRGx is at '1'. Only a hardware reset of the PWM controller can disable the hardware write protection. Moreover, to meet security requirements, the PIO lines associated with the PWM can not be configured through the PIO interface." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WPRG0" edc:desc="Write Protection Register Group 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPRG1" edc:desc="Write Protection Register Group 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPRG2" edc:desc="Write Protection Register Group 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPRG3" edc:desc="Write Protection Register Group 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPRG4" edc:desc="Write Protection Register Group 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPRG5" edc:desc="Write Protection Register Group 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protection Key" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPCMD field.Always reads as 0" edc:when="(field &amp; 0xFFFFFF) == 0x50574D"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400200E8" edc:access="rrrrrrrrrrrrrrrr--rrrrrrr-rrrrrr" edc:cname="PWM0_WPSR" edc:impl="0xFFFF3FBF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="WPSWS0" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPSWS1" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPSWS2" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPSWS3" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPSWS4" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPSWS5" edc:desc="Write Protect SW Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protect Violation Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS0" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS1" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS2" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS3" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS4" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WPHWS5" edc:desc="Write Protect HW Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protect Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400200EC" edc:offset="0x44"/>
      <edc:SFRDef edc:_addr="0x40020130" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP0PWM0_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
