Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.3.66/samv71b/edc/ATSAMV71J19B.PIC
      <edc:SFRDef edc:_addr="0x4005C180" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP5PWM1_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C184" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP5PWM1_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C188" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP5PWM1_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C18C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP5PWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C190" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP6PWM1_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C194" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP6PWM1_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C198" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP6PWM1_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C19C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP6PWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C1A0" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP7PWM1_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_INCREMENT" edc:desc="Compare when counter is incrementing" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="COMPARE_AT_DECREMENT" edc:desc="Compare when counter is decrementing" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C1A4" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP7PWM1_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C1A8" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP7PWM1_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C1AC" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP7PWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4005C1B0" edc:offset="0x50"/>
      <edc:SFRDef edc:_addr="0x4005C200" edc:access="------------nnnn--nnnnnn----nnnn" edc:cname="PWM_CH_NUM0PWM1_CMR" edc:impl="0xF3F0F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CPRE" edc:desc="Channel Pre-scaler" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="MCK_DIV_1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="CLKA" edc:desc="Clock A" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="CLKB" edc:desc="Clock B" edc:when="(field &amp; 0xF) == 0xC"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CALG" edc:desc="Channel Alignment" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LEFT_ALIGNED" edc:desc="Left aligned" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CENTER_ALIGNED" edc:desc="Center aligned" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Channel Polarity" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LOW_POLARITY" edc:desc="Waveform starts at low level" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HIGH_POLARITY" edc:desc="Waveform starts at high level" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CES" edc:desc="Counter Event Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SINGLE_EVENT" edc:desc="At the end of PWM period" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DOUBLE_EVENT" edc:desc="At half of PWM period AND at the end of PWM period" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="UPDS" edc:desc="Update Selection" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_PERIOD" edc:desc="At the next end of PWM period" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE_AT_HALF_PERIOD" edc:desc="At the next end of Half PWM period" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DPOLI" edc:desc="Disabled Polarity Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCTS" edc:desc="Timer Counter Trigger Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DTE" edc:desc="Dead-Time Generator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTHI" edc:desc="Dead-Time PWMHx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTLI" edc:desc="Dead-Time PWMLx Output Inverted" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PPM" edc:desc="Push-Pull Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C204" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CH_NUM0PWM1_CDTY" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CDTY" edc:desc="Channel Duty-Cycle" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
