Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.3.66/samv71b/edc/ATSAMV71J19B.PIC
      <edc:SFRDef edc:_addr="0x400781E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID6XDMAC_CSA" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SA" edc:desc="Channel x Source Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID6XDMAC_CDA" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="DA" edc:desc="Channel x Destination Address" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-n" edc:cname="XDMAC_CHID6XDMAC_CNDA" edc:impl="0xFFFFFFFD" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDAIF" edc:desc="Channel x Next Descriptor Interface" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NDA" edc:desc="Channel x Next Descriptor Address" edc:nzwidth="0x1E"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781EC" edc:access="---------------------------nnnnn" edc:cname="XDMAC_CHID6XDMAC_CNDC" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="NDE" edc:desc="Channel x Next Descriptor Enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_DIS" edc:desc="Descriptor fetch is disabled." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DSCR_FETCH_EN" edc:desc="Descriptor fetch is enabled." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDSUP" edc:desc="Channel x Next Descriptor Source Update" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UNCHANGED" edc:desc="Source parameters remain unchanged." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SRC_PARAMS_UPDATED" edc:desc="Source parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDDUP" edc:desc="Channel x Next Descriptor Destination Update" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UNCHANGED" edc:desc="Destination parameters remain unchanged." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DST_PARAMS_UPDATED" edc:desc="Destination parameters are updated when the descriptor is retrieved." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NDVIEW" edc:desc="Channel x Next Descriptor View" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NDV0" edc:desc="Next Descriptor View 0" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="NDV1" edc:desc="Next Descriptor View 1" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="NDV2" edc:desc="Next Descriptor View 2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="NDV3" edc:desc="Next Descriptor View 3" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781F0" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID6XDMAC_CUBC" edc:impl="0xFFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="UBLEN" edc:desc="Channel x Microblock Length" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781F4" edc:access="--------------------nnnnnnnnnnnn" edc:cname="XDMAC_CHID6XDMAC_CBC" edc:impl="0xFFF" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="BLEN" edc:desc="Channel x Block Length" edc:nzwidth="0xC"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781F8" edc:access="-nnnnnnnnnn-nnnn-nnnnnnnnn-n-nnn" edc:cname="XDMAC_CHID6XDMAC_CC" edc:impl="0x7FEF7FD7" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="TYPE" edc:desc="Channel x Transfer Type" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MEM_TRAN" edc:desc="Self-triggered mode (memory-to-memory transfer)." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PER_TRAN" edc:desc="Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer)." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MBSIZE" edc:desc="Channel x Memory Burst Size" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:desc="The memory burst size is set to one." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FOUR" edc:desc="The memory burst size is set to four." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="EIGHT" edc:desc="The memory burst size is set to eight." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SIXTEEN" edc:desc="The memory burst size is set to sixteen." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DSYNC" edc:desc="Channel x Synchronization" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="PER2MEM" edc:desc="Peripheral-to-memory transfer." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MEM2PER" edc:desc="Memory-to-peripheral transfer." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SWREQ" edc:desc="Channel x Software Request Trigger" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="HWR_CONNECTED" edc:desc="Hardware request line is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SWR_CONNECTED" edc:desc="Software request is connected to the peripheral request line." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MEMSET" edc:desc="Channel x Fill Block of memory" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NORMAL_MODE" edc:desc="Memset is not activated." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="HW_MODE" edc:desc="Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CSIZE" edc:desc="Channel x Chunk Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CHK_1" edc:desc="1 data transferred" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CHK_2" edc:desc="2 data transferred" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CHK_4" edc:desc="4 data transferred" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CHK_8" edc:desc="8 data transferred" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CHK_16" edc:desc="16 data transferred" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DWIDTH" edc:desc="Channel x Data Width" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="BYTE" edc:desc="The data size is set to 8 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="HALFWORD" edc:desc="The data size is set to 16 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="WORD" edc:desc="The data size is set to 32 bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SIF" edc:desc="Channel x Source Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is read through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is read through the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DIF" edc:desc="Channel x Destination Interface Identifier" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="AHB_IF0" edc:desc="The data is written through the system bus interface 0." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="AHB_IF1" edc:desc="The data is written though the system bus interface 1." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="SAM" edc:desc="Channel x Source Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary, the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DAM" edc:desc="Channel x Destination Addressing Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="FIXED_AM" edc:desc="The address remains unchanged." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="INCREMENTED_AM" edc:desc="The addressing mode is incremented (the increment size is set to the data size)." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="UBS_AM" edc:desc="The microblock stride is added at the microblock boundary." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="UBS_DS_AM" edc:desc="The microblock stride is added at the microblock boundary; the data stride is added at the data boundary." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="INITD" edc:desc="Channel Initialization Terminated (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="Channel initialization is in progress." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="TERMINATED" edc:desc="Channel initialization is completed." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RDIP" edc:desc="Read in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active read transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A read transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WRIP" edc:desc="Write in Progress (this bit is read-only)" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DONE" edc:desc="No active write transaction on the bus." edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IN_PROGRESS" edc:desc="A write transaction is in progress." edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Channel x Peripheral Hardware Request Line Identifier" edc:nzwidth="0x7">
              <edc:SFRFieldSemantic edc:cname="QSPI_TX" edc:desc="QSPI_TX" edc:when="(field &amp; 0x7F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="QSPI_RX" edc:desc="QSPI_RX" edc:when="(field &amp; 0x7F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="USART0_TX" edc:desc="USART0_TX" edc:when="(field &amp; 0x7F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="USART0_RX" edc:desc="USART0_RX" edc:when="(field &amp; 0x7F) == 8"/>
              <edc:SFRFieldSemantic edc:cname="USART1_TX" edc:desc="USART1_TX" edc:when="(field &amp; 0x7F) == 9"/>
              <edc:SFRFieldSemantic edc:cname="USART1_RX" edc:desc="USART1_RX" edc:when="(field &amp; 0x7F) == 10"/>
              <edc:SFRFieldSemantic edc:cname="PWM0" edc:desc="PWM0" edc:when="(field &amp; 0x7F) == 13"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_TX" edc:desc="TWIHS0_TX" edc:when="(field &amp; 0x7F) == 14"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS0_RX" edc:desc="TWIHS0_RX" edc:when="(field &amp; 0x7F) == 15"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_TX" edc:desc="TWIHS1_TX" edc:when="(field &amp; 0x7F) == 16"/>
              <edc:SFRFieldSemantic edc:cname="TWIHS1_RX" edc:desc="TWIHS1_RX" edc:when="(field &amp; 0x7F) == 17"/>
              <edc:SFRFieldSemantic edc:cname="UART0_TX" edc:desc="UART0_TX" edc:when="(field &amp; 0x7F) == 20"/>
              <edc:SFRFieldSemantic edc:cname="UART0_RX" edc:desc="UART0_RX" edc:when="(field &amp; 0x7F) == 21"/>
              <edc:SFRFieldSemantic edc:cname="UART1_TX" edc:desc="UART1_TX" edc:when="(field &amp; 0x7F) == 22"/>
              <edc:SFRFieldSemantic edc:cname="UART1_RX" edc:desc="UART1_RX" edc:when="(field &amp; 0x7F) == 23"/>
              <edc:SFRFieldSemantic edc:cname="UART2_TX" edc:desc="UART2_TX" edc:when="(field &amp; 0x7F) == 24"/>
              <edc:SFRFieldSemantic edc:cname="UART2_RX" edc:desc="UART2_RX" edc:when="(field &amp; 0x7F) == 25"/>
              <edc:SFRFieldSemantic edc:cname="DACC0" edc:desc="DACC0" edc:when="(field &amp; 0x7F) == 30"/>
              <edc:SFRFieldSemantic edc:cname="SSC_TX" edc:desc="SSC_TX" edc:when="(field &amp; 0x7F) == 32"/>
              <edc:SFRFieldSemantic edc:cname="SSC_RX" edc:desc="SSC_RX" edc:when="(field &amp; 0x7F) == 33"/>
              <edc:SFRFieldSemantic edc:cname="PIOA" edc:desc="PIOA" edc:when="(field &amp; 0x7F) == 34"/>
              <edc:SFRFieldSemantic edc:cname="AFEC0" edc:desc="AFEC0" edc:when="(field &amp; 0x7F) == 35"/>
              <edc:SFRFieldSemantic edc:cname="AFEC1" edc:desc="AFEC1" edc:when="(field &amp; 0x7F) == 36"/>
              <edc:SFRFieldSemantic edc:cname="AES_TX" edc:desc="AES_TX" edc:when="(field &amp; 0x7F) == 37"/>
              <edc:SFRFieldSemantic edc:cname="AES_RX" edc:desc="AES_RX" edc:when="(field &amp; 0x7F) == 38"/>
              <edc:SFRFieldSemantic edc:cname="PWM1" edc:desc="PWM1" edc:when="(field &amp; 0x7F) == 39"/>
              <edc:SFRFieldSemantic edc:cname="TC0" edc:desc="TC0" edc:when="(field &amp; 0x7F) == 40"/>
              <edc:SFRFieldSemantic edc:cname="TC3" edc:desc="TC3" edc:when="(field &amp; 0x7F) == 41"/>
              <edc:SFRFieldSemantic edc:cname="TC6" edc:desc="TC6" edc:when="(field &amp; 0x7F) == 42"/>
              <edc:SFRFieldSemantic edc:cname="TC9" edc:desc="TC9" edc:when="(field &amp; 0x7F) == 43"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400781FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="XDMAC_CHID6XDMAC_CDS_MSP" edc:nzwidth="0x20" ltx:memberofperipheral="XDMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="XDMAC">
            <edc:SFRFieldDef edc:cname="SDS_MSP" edc:desc="Channel x Source Data stride or Memory Set Pattern" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="DDS_MSP" edc:desc="Channel x Destination Data Stride or Memory Set Pattern" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
