Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.3.66/samv71b/edc/ATSAMV71J19B.PIC
      <edc:SFRDef edc:_addr="0xE000ED34" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="MMFAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Data address for an MPU fault" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED38" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="BFAR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="ADDRESS" edc:desc="Data address for a precise bus fault" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED3C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFSR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB"/>
      <edc:AdjustPoint edc:_addr="0xE000ED40" edc:offset="0x38"/>
      <edc:SFRDef edc:_addr="0xE000ED78" edc:access="--rrrrrr------------------------" edc:cname="CLIDR" edc:impl="0x3F000000" edc:mclr="00001001000000000000000000000011" edc:nzwidth="0x20" edc:por="00001001000000000000000000000011" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x18"/>
            <edc:SFRFieldDef edc:cname="LoC" edc:desc="Level of Coherency" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="LEVEL_1" edc:desc="if neither instruction nor data cache is implemented" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LEVEL_2" edc:desc="if either cache is implemented" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LoU" edc:desc="Level of Unification" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="LEVEL_1" edc:desc="if neither instruction nor data cache is implemented" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="LEVEL_2" edc:desc="if either cache is implemented" edc:when="(field &amp; 0x7) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED7C" edc:access="rrr-rrrrrrrrrrrr------------rrrr" edc:cname="CTR" edc:impl="0xEFFF000F" edc:mclr="10000011000000111100000000000011" edc:nzwidth="0x20" edc:por="10000011000000111100000000000011" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IMINLINE" edc:desc="Smallest cache line of all the instruction caches under the control of the processor" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="DMINLINE" edc:desc="Smallest cache line of all the data and unified caches under the core control" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="ERG" edc:desc="Exclusives Reservation Granule" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CWG" edc:desc="Cache Writeback Granule" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FORMAT" edc:desc="Register format" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED80" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CCSIDR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="LineSize" edc:desc="number of words in each cache line" edc:nzwidth="0x3"/>
            <edc:SFRFieldDef edc:cname="Associativity" edc:desc="number of ways" edc:nzwidth="0x9"/>
            <edc:SFRFieldDef edc:cname="NumSets" edc:desc="number of sets" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="WA" edc:desc="Write allocation support" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RA" edc:desc="Read allocation support" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WB" edc:desc="Write-Back support" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WT" edc:desc="Write-Through support" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED84" edc:access="----------------------------nnnn" edc:cname="CSSELR" edc:impl="0xF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:SFRFieldDef edc:cname="IND" edc:desc="selection of instruction or data cache" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DATA" edc:desc="Data cache" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INSTRUCTION" edc:desc="Instruction cache" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:desc="cache level selected" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED88" edc:access="--------nnnn--------------------" edc:cname="CPACR" edc:impl="0xF00000" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SCB">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SCB">
            <edc:AdjustPoint edc:offset="0x14"/>
            <edc:SFRFieldDef edc:cname="CP10" edc:desc="Access privileges for coprocessor 10." edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="CP11" edc:desc="Access privileges for coprocessor 11." edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE000ED8C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0xE000ED90" edc:access="--------nnnnnnnnnnnnnnnn-------n" edc:cname="TYPE" edc:impl="0xFFFF01" edc:mclr="00000000000000000001000000000000" edc:nzwidth="0x20" edc:por="00000000000000000001000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="SEPARATE" edc:desc="Indicates support for unified or separate instruction and date memory maps." edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DREGION" edc:desc="Indicates the number of supported MPU instruction regions." edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="IREGION" edc:desc="Indicates the number of supported MPU data regions." edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED94" edc:access="-----------------------------nnn" edc:cname="CTRL" edc:impl="0x7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enables the MPU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HFNMIENA" edc:desc="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers." edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRIVDEFENA" edc:desc="Enables privileged software access to the default memory map." edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000ED98" edc:access="------------------------nnnnnnnn" edc:cname="RNR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers." edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
